// tslint:disable: max-line-length
export const dbPediaMockServerData = [
  {
    query: `select ?a where{dbr:John_Farrar dbo:abstract ?a }`,
    response: {
      head: {
        link: [],
        vars: ["a"]
      },
      results: {
        distinct: false,
        ordered: true,
        bindings: [
          {
            a: {
              type: "literal",
              "xml:lang": "fr",
              value:
                "Mamoru Samuragochi (佐村河内 守, Samuragōchi Mamoru) est un japonais connu comme compositeur de musiques de jeux vidéo dont celles de Resident Evil et Onimusha. Confondu par les révélations de son nègre, Takashi Niigaki, en direct à la télévision, le « Beethoven japonais » révèle en février 2014 que la plus grande partie de son œuvre des dix-huit dernières années a été composée par un autre. Il n'était pas sourd non plus."
            }
          },
          {
            a: {
              type: "literal",
              "xml:lang": "it",
              value:
                "Soprannominato il \"Beethoven moderno\" dai media, entrò nelle cronache mondiali nel febbraio 2014 quando venne svelato che la maggior parte delle opere a lui attribuite nei precedenti diciotto anni vennero scritte e composte in realtà da un'altra persona. Egli ha sempre sostenuto durante la sua carriera di essere sordo, affermazione anche questa messa in discussione dal ghostwriter della sua musica, il quale affermò che Samuragōchi in realtà possedesse un udito perfetto, e che la sua sordità fosse una messinscena. In seguito a queste affermazioni Samuragōchi confessò di aver riacquistato parzialmente l'udito nel 2011."
            }
          },
          {
            a: {
              type: "literal",
              "xml:lang": "ja",
              value:
                "佐村河内 守（さむらごうち まもる、1963年9月21日 - ）は、広島県出身の人物。 中途失聴とされる聴覚障害がありながら『鬼武者』のゲーム音楽や「交響曲第1番《HIROSHIMA》」などを作曲したとして脚光を浴びたが、2014年2月5日、自作としていた曲がゴーストライターの代作によるものと発覚（「」の項を参照）。聴覚障害の程度についても疑義を持たれており、ゴーストライターを務めた作曲家の新垣隆は、「佐村河内は18年間全ろうであると嘘をつき続けていた」と『週刊文春』に掲載された独占手記で主張した。横浜市による再検査では中度の感音性難聴と診断され、障害者手帳の交付の対象となるレベルではなかった。"
            }
          },
          {
            a: {
              type: "literal",
              "xml:lang": "pl",
              value:
                "Mamoru Samuragōchi (jap. 佐村河内守 Samuragōchi Mamoru, ur. 21 września 1963 w Hiroszimie) − japoński kompozytor muzyki klasycznej, zwany „japońskim Beethovenem”."
            }
          },
          {
            a: {
              type: "literal",
              "xml:lang": "zh",
              value:
                "佐村河内 守（1963年9月21日－），生於日本廣島縣，作曲家，因患耳疾仍努力不懈作曲，曾一度被譽為「日本貝多芬」。2014年2月4日，佐村河內守由律師代表提出聲明，承認自1996年開始請友人代為寫作樂曲，引起輿論譁然。"
            }
          },
          {
            a: {
              type: "literal",
              "xml:lang": "ru",
              value:
                "Мамору Самураготи (яп. 佐村河内 守 Самураготи Мамору, род. 21 сентября 1963 в посёлке Ицукаити уезда Саэки префектуры Хиросима) — японский композитор. Известность получил как автор музыки к видеоиграм. В 35 лет потерял слух. Произведение Самураготи симфония № 1 «Хиросима» была продана тиражом более 180 тысяч копий. В 2014 году Такаси Ниигаки, композитор и преподаватель в консерватории Тохо Гакуэн, заявил, что в течение многих лет работал «музыкальным негром» для Самураготи и писал за него произведения.Ниигаки также сообщил, что Самураготи только притворяется глухим, а на самом деле слух у него нормальный. Считался автором произведений: симфония № 1 «Хиросима»; «Реквием» для фортепиано; саундтрек к фильму «Космос»; саундтрек к играм «Resident Evil» и «Onimusha: Warlords»."
            }
          },
          {
            a: {
              type: "literal",
              "xml:lang": "en",
              value:
                'Mamoru Samuragochi (佐村河内 守 Samuragōchi Mamoru, born 21 September 1963) is a Japanese composer from Hiroshima Prefecture who falsely said that he was totally deaf. He was the name credited for the video games Resident Evil: Dual Shock Ver. and Onimusha: Warlords. He said throughout his career that he was deaf which led to foreign media dubbing him a "digital-age Beethoven". In February 2014, it was revealed that most of the work attributed to him over the previous 18 years had been written by Takashi Niigaki.'
            }
          }
        ]
      }
    }
  }
]
